app/controllers/categories_controller.rb

INSERT INTO "categories" ("created_at", "title", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Thu, 07 Nov 2013 12:44:52 UTC +00:00], ["title", "1"], ["updated_at", Thu, 07 Nov 2013 12:44:52 UTC +00:00]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save

UPDATE "categories" SET "title" = $1, "updated_at" = $2 WHERE "categories"."id" = 4  [["title", "Testing2"], ["updated_at", Thu, 07 Nov 2013 13:10:04 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @category.update(category_params)