app/controllers/static_pages_controller.rb

SELECT "tasklists".* FROM "tasklists"
---
  def start
    @users = User.all
    @tasklists = Tasklist.all