app/controllers/statuses_controller.rb

INSERT INTO "statuses" ("created_at", "title", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Mon, 18 Nov 2013 13:23:26 UTC +00:00], ["title", "Kochen"], ["updated_at", Mon, 18 Nov 2013 13:23:26 UTC +00:00]]
---
  def create
    @status = Status.new(status_params)

    respond_to do |format|
      if @status.save

UPDATE "statuses" SET "title" = $1, "updated_at" = $2 WHERE "statuses"."id" = 1  [["title", "Openjjj"], ["updated_at", Mon, 18 Nov 2013 13:40:14 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @status.update(status_params)