app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE (assigned_to = 3 AND tasklist_id = '1')
---
  def index
    if(current_user != nil)
      @tasks = Task.where("assigned_to = ?", current_user.id)

INSERT INTO "tasks" ("assigned_to", "category_id", "created_at", "description", "due_date", "etc", "pointvalue", "status_id", "tasklist_id", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save