app/controllers/tasklists_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."tasklist_id" = $1  [["tasklist_id", 1]]
---
  def index
    if(current_user != nil)
      @tasklists = Task.where("user_id = ?", current_user.id)

INSERT INTO "tasklists" ("created_at", "name", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Sun, 08 Dec 2013 21:22:22 UTC +00:00], ["name", "Test"], ["updated_at", Sun, 08 Dec 2013 21:22:22 UTC +00:00], ["user_id", 3]]
---
  def create
    @tasklist = Tasklist.new(tasklist_params)

    respond_to do |format|
      if @tasklist.save

DELETE FROM "tasklists" WHERE "tasklists"."id" = $1  [["id", 2]]
---
  def destroy
    @tasklist.destroy

SELECT "tasklists".* FROM "tasklists" WHERE "tasklists"."id" = $1 LIMIT 1  [["id", "2"]]
---
    def set_tasklist
      @tasklist = Tasklist.find(params[:id])